# SetSelectedElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..SetSelectedElementIds Method
NavisworksExportOptions Class See Also
---
Sets the element ids of the elements to export. Used only when ExportScope = SelectedElements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetSelectedElementIds(
	ICollection<ElementId> ids
)
```

Visual Basic
---
```text
Public Sub SetSelectedElementIds ( _
	ids As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
void SetSelectedElementIds(
	ICollection<ElementId^>^ ids
)
```

# ### Parameters
ids
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)>
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace